rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c

#include "PeripheralSettingsAndMacros.h"

#include <plib.h>
#include <xc.h>
#include <time.h>

volatile int PWM1_Value = 10;
volatile int PWM2_Value = 100;

volatile int PWM1_DC = 50;
volatile int PWM2_DC = 50;

volatile int PWM1_DC_Value;
volatile int PWM2_DC_Value;


volatile int clock_scale_down = 10; // 10 fold slower execution 
volatile int clock_scale_down_count = 0; // 10 fold slower execution 

int DoAdjustPID = 0;
int DutyCyclePWM1 = 50;


BOOL    DoReadUART2 = FALSE;





void WaitMS(unsigned int ms)
{
    unsigned int count = 0;
    unsigned int i = 0;
    
    while(count++ < ms)
    {
        i = 0;
        while(i++ < 10000)
        {
            asm("nop");
        }
    }
}


void InitSystem()
{
    SYSTEMConfigPerformance(SYS_FREQ);  // This function sets the PB-Div to 1. Also optimises cache for 72Mhz etc..
    mOSCSetPBDIV(OSC_PB_DIV_1);           // Therefore, configure the PB bus to run at 1/2 CPU Frequency
                                                              // you may run at PBclk of 72Mhz if you like too (omit this step)
                                                              // This will double the PWM frequency.
    

//    SYSTEMConfigPB()
    INTEnableSystemMultiVectoredInt();
    
    InitUART1();
    __XC_UART = 1;
    
    InitUART2();
    
    InitSPI2(16);    
}



int InitUART1()
{
    int uart_id = 0;

//    #if defined (__32MX220F032D__) || defined (__32MX250F128D__)
// //   PPSInput(2,U2RX,RPB5); // Assign RPB5 as input pin for U2RX
// //   PPSOutput(4,RPB0,U2TX); // Set RPB0 pin as output for U2TX
//    #elif defined (__32MX430F064L__) || (__32MX450F256L__) || (__32MX470F512L__)
////    PPSInput(2,U1RX,RPF4); // Assign RPF4 as input pin for U1RX
////    PPSOutput(2,RPF5,U1TX); // Set RPF5 pin as output for U1TX
    
    PPS_Unlock();

    U1RXRbits.U1RXR = 2; // 0b0010; // RF4 input J11.46
    RPF5Rbits.RPF5R = 3; //0b0011; TX output J11.48
    
    PPS_Lock();
    
//    #endif
    uint32_t brate;
    
//    brate = 115200L;
    brate = 2L*500000L;
//    brate = 460800;//921600L/2L;

    UARTConfigure((UART_MODULE)uart_id, UART_ENABLE_PINS_TX_RX_ONLY);
    UARTSetFifoMode((UART_MODULE)uart_id,(UART_FIFO_MODE) (UART_INTERRUPT_ON_TX_NOT_FULL | UART_INTERRUPT_ON_RX_NOT_EMPTY));
    UARTSetLineControl((UART_MODULE)uart_id,(UART_LINE_CONTROL_MODE) (UART_DATA_SIZE_8_BITS | UART_PARITY_NONE | UART_STOP_BITS_1));
    UARTSetDataRate((UART_MODULE)uart_id, GetPeripheralClock(), brate);
    UARTEnable((UART_MODULE)uart_id, (UART_ENABLE_MODE) UART_ENABLE_FLAGS(UART_PERIPHERAL | UART_RX | UART_TX));

    return uart_id;
}

int InitUART2()
{
    int uart_id = 1;

//    mPORTCSetPinsDigitalIn(BIT_1 | BIT_3);
//    mPORTCSetPinsDigitalOut(BIT_2 | BIT_4);

    mPORTCSetPinsDigitalIn(BIT_1 );
    mPORTCSetPinsDigitalOut(BIT_4);
    
    
    PPS_Unlock();

    U2RXRbits.U2RXR = 0b1010; // 0b0010; // RC1 input J10.18
    U2CTSRbits.U2CTSR = 0b1100; // RC3 .. Input  J10.20
    
    RPC2Rbits.RPC2R = 0b0001; // U2RTS 0b0011; RTS output J10.19
    RPC4Rbits.RPC4R = 0b0001; // U2TX  UTX  J10.21
    
    PPS_Lock();
    
    unsigned int brate;
    brate = 115200L;//115200L * 1L;
//    brate = 256000L;//115200L * 1L;
//    brate = 921600L;
    
//    U2MODEbits.BRGH = 4;
//    U2MODEbits.
 
    UARTConfigure((UART_MODULE)uart_id, UART_ENABLE_HIGH_SPEED | UART_ENABLE_PINS_TX_RX_ONLY);
    UARTSetFifoMode((UART_MODULE)uart_id,(UART_FIFO_MODE) (UART_INTERRUPT_ON_TX_NOT_FULL | UART_INTERRUPT_ON_RX_NOT_EMPTY));
    UARTSetLineControl((UART_MODULE)uart_id,(UART_LINE_CONTROL_MODE) (UART_DATA_SIZE_8_BITS | UART_PARITY_NONE | UART_STOP_BITS_1));
    UARTSetDataRate((UART_MODULE)uart_id, GetPeripheralClock(), brate);

    SetPriorityIntU2(UART_INT_PR3);
    mU2ClearAllIntFlags();
    mU2RXIntEnable(0);
//    
//    EnableIntU2RX;
//    mU2
//    mU2RXIntEnable(1);
    
    UARTEnable((UART_MODULE)uart_id, (UART_ENABLE_MODE) UART_ENABLE_FLAGS(UART_PERIPHERAL | UART_RX | UART_TX));

//    UART_PERIPHERAL
    return uart_id;
}

void MapSPI1MasterPins()
{
    UnlockPPS();
 
    SDI1Rbits.SDI1R = 0b1010; //10;  // 0b1010 // RPC4  // SDI1
    RPD0Rbits.RPD0R = 0b1000; // // SDO1
//    RPD9Rbits.RPD9R = 7; //0b0111; // SS2
    RPB2Rbits.RPB2R = 0b0111; //7; //0b0111; // SS2
  
    LockPPS();

    mPORTDSetPinsDigitalOut(BIT_10);// SCK1 out
    mPORTCSetPinsDigitalIn(BIT_4);// SDI1 in
    CNPDCbits.CNPDC4 = 1; // pull down

    mPORTDSetPinsDigitalOut(BIT_0);// SDO1 out

//    mPORTDSetPinsDigitalOut(BIT_9);// SS1 out
//    mPORTDSetBits(BIT_9); // set high by default}
//    CNPDDbits.CNPDD9 = 1; // pull down

    mPORTBSetPinsDigitalOut(BIT_2);// SS1 out
    mPORTBClearBits(BIT_2); // set high by default}
    CNPDBbits.CNPDB2 = 1; // pull down
    
}

void MapSPI1SlavePins()
{
    UnlockPPS();
    
    // output pin SDO1
    RPD0Rbits.RPD0R = 0b1000; // // SDO1 // RD0 // J10.43
 
    // input pins SDI1 and SS1

   //    SDI1Rbits.SDI1R = 0b1010;  // 0b1010 // RPC4  // SDI1
    SDI1Rbits.SDI1R = 0b0010;  // 0b0010 // RPF5  // SDI1 // J10.52
    SS1Rbits.SS1R = 0b1111; // RB2 // SS1 // J10.46

//    RPB2Rbits.RPB2R = 0b0111; //0b0111; // SS1
//    RPD9Rbits.RPD9R = 7; //0b0111; // SS1
//    SS1Rbits.SS1R = 0; // RPD9 input

    LockPPS();

//    mPORTCSetPinsDigitalIn(BIT_4);// SDI1 in J10.44
//    mPORTCClearBits(BIT_4);
//    CNPDCbits.CNPDC4 = 1; // pull down
    
    mPORTFSetPinsDigitalIn(BIT_5);// SDI1 in J10.52
    mPORTFClearBits(BIT_5);
    CNPDFbits.CNPDF5 = 1;
            
    mPORTDSetPinsDigitalIn(BIT_10);// SCK1 out J10.41
    
    mPORTDSetPinsDigitalOut(BIT_0);// SDO1 out // J10.43
//    mPORTDSetPinsDigitalIn(BIT_9);// SS1 out
//    mPORTDClearBits(BIT_9); // set high by default}
//    CNPDDbits.CNPDD9 = 1; // pull down
    
    mPORTBSetPinsDigitalIn(BIT_2);// SS1 in J10.46
    mPORTBClearBits(BIT_2); // set high by default}
    CNPDBbits.CNPDB2 = 1;
}


void MapSPI2MasterPins()
{
    PPS_Unlock();
 
    SDI2Rbits.SDI2R = 1; // RPG7 = 0b0001 // SDI2
    RPG8Rbits.RPG8R = 6; //0b0110; // SDO2
    RPG9Rbits.RPG9R = 6; //0b0110; // SS2
    
    PPS_Lock();

    mPORTGSetPinsDigitalOut(BIT_6);// SCK2 out
    mPORTGSetPinsDigitalIn(BIT_7);// SDI2 in
    
