rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    CNPDGbits.CNPDG7 = 1; // pull down

    mPORTGSetPinsDigitalOut(BIT_8);// SDO2 out
    mPORTGSetPinsDigitalOut(BIT_9);// SS2 out
    CNPDGbits.CNPDG9 = 1; // pull down

}


void MapSPI2SlavePins()
{
    PPS_Unlock();
 
    SDI2Rbits.SDI2R = 1; // RPG7 = 0b0001 // SDI2
    RPG8Rbits.RPG8R = 6; //0b0110; // SDO2
    SS2Rbits.SS2R = 1;// RPG9 input
    
    PPS_Lock();
    
  
    mPORTGSetPinsDigitalIn(BIT_6);// SCK2 in
    mPORTGSetPinsDigitalIn(BIT_7);// SDI2 in
//    CNPDGbits.CNPDG7 = 1; // pull down
    mPORTGClearBits(BIT_7);
    mPORTGSetPinsDigitalOut(BIT_8);// SDO2 out
    CNPDGbits.CNPDG7 = 1;
  
    mPORTGSetPinsDigitalIn(BIT_9);// SS2 in // RG9
    CNPDGbits.CNPDG9 = 1; // pull down
    mPORTGClearBits(BIT_9); // set low by default
}

//
//int SetPWMDutyCycle(float duty_cycle)
//{
//    PWM1_DC_Value = (PR2 + 1) * ((float)duty_cycle / 100.0);
//    return PWM1_DC_Value;
//}


int SetPWMDutyCycle(int pwm_number, int duty_cycle)
{
    int dval;
    if(pwm_number == 1)
    {
        OC1RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC1RS;
    }
    
    if(pwm_number == 2)
    {
        OC2RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC2RS;
    }
    
    if(pwm_number == 3)
    {
        OC3RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC3RS;
    }

    if(pwm_number == 4)
    {
        OC4RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC4RS;
    }

    if(pwm_number == 5)
    {
        OC5RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC5RS;
    }
    
}

void TurnOffPWM(int pwm_number)
{
    switch(pwm_number)
    {
        case 1:
            OC1CONbits.ON = 0;
            break;
        case 2:
            OC2CONbits.ON = 0;
            break;
        case 3:
            OC3CONbits.ON = 0;
            break;
        case 4:
            OC4CONbits.ON = 0;
            break;
        case 5:
            OC5CONbits.ON = 0;
            break;
    }
}

void TurnOnPWM(int pwm_number)
{
    switch(pwm_number)
    {
        case 1:
            OC1CONbits.ON = 1;
            break;
        case 2:
            OC2CONbits.ON = 1;
            break;
        case 3:
            OC3CONbits.ON = 1;
            break;
        case 4:
            OC4CONbits.ON = 1;
            break;
        case 5:
            OC5CONbits.ON = 1;
            break;
    }
}

void InitPWM(int pwm_frequency, int duty_cycle)
{
    int  samplerate = pwm_frequency;

    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1
//    RPD2Rbits.RPD2R = 0b1011; // OC3
    PPS_Lock();

    OC1CON = 0x0006;
    
    PR2 = ((int)SYS_FREQ/ (pwm_frequency))-1;
    
    OC1RS = (PR2+1) * ((float)duty_cycle /100.0);
    
//    OC2RS = ((PR2+1) *  PWM2_DC) /(int)100;
//    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
//    OpenTimer2(T2_ON | T2_PS_1_256 | T2_SOURCE_INT, 0xFFFF);         // init Timer2 mode and period reg (PR2)

    T2CONbits.TCKPS = 0b101;
    
    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int

    T2CONbits.ON = 1;
    OC1CONbits.ON = 1;
    
//    printf("PR2 == %d", PR2, OC1RS, OC2RS);

//    SetDCOC1PWM(PWM1_Value);
//    SetDCOC2PWM(PWM2_Value);

//T2_32BIT_MODE_ON

//    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
//    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
//    mT2IntEnable(1);       // allow T2 int
}



void InitPWM_v3(int pwm_frequency, int duty_cycle)
{
    int  samplerate = pwm_frequency;

    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1
//    RPD2Rbits.RPD2R = 0b1011; // OC3
    PPS_Lock();

    OC1CON = 0x0006;
    
    PR2 = ((int)SYS_FREQ/ (pwm_frequency*256))-1;
    
    int val = ((int)SYS_FREQ/ (pwm_frequency*1))-1;
    int dc = (PR2+1) * ((float)duty_cycle /100.0);

//    OC1RS = (PR2+1) * ((float)duty_cycle /100.0);
    
//    OC2RS = ((PR2+1) *  PWM2_DC) /(int)100;
    
    SetDCOC1PWM(dc);

    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
    
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT, val);         // init Timer2 mode and period reg (PR2)

    
//    PR2 = ((int)SYS_FREQ/ (pwm_frequency*256))-1;
    
//    T2CONSET = 0x8000;
//    OC1CONSET = 0x8000;
    
//    printf("PR2 == %d", PR2, OC1RS, OC2RS);

//    SetDCOC1PWM(PWM1_Value);
//    SetDCOC2PWM(PWM2_Value);

//T2_32BIT_MODE_ON

    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int
}


void InitTimer1(uint32_t freq)
{
    int freq_val = ((int)SYS_FREQ/ (freq))-1;
    
//    int correct_freq = freq * 
    
    PR1 = (uint32_t)SYS_FREQ/ ((uint32_t)(freq*( (uint32_t)128)) )-1;
    
    T1CONbits.TCKPS = 0b10; // 128
    
    mT1SetIntPriority(3);  // you don't have to use ipl3, but make sure INT definition is the same as your choice here
    mT1ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT1IntEnable(1);       // allow T2 int

    T1CONbits.ON = 1;
}



//void InitPWM()
//{
//    SetDCOC1PWM(3600);
//    
//    INTEnableSystemMultiVectoredInt();         // make separate interrupts possible
// 
//    int samplerate = 100;
// 
//    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE,0,0); // init OC1 module, T2 =source 
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE,0,0); // init OC2 module, T2 =source(you could do more OCx)
//    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT,FPB/samplerate);         // init Timer2 mode and period reg (PR2)
// 
//    PR2 = FPB/samplerate-1;
//
//    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
//    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
//    mT2IntEnable(1);       // allow T2 int
//    
//    
//}





void InitPWM_v2(int sample_rate)
{
    
    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1
    RPD2Rbits.RPD2R = 0b1011; // OC3
 
    PPS_Lock();
    
//    mPORT
    
    int  samplerate = sample_rate;
    int PR2 = PBUS_CLOCK/samplerate-1;

